<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"a060c5a2a149fe6a0c0c5938abaec1ef60fb5d0cdfa58757421b214087470eef","plan_job_ref":"Job Staging Image Build & Push #20 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7349118301","plan_hash":"bb3c0383d7de517a77a7d65e1843908abe92669e690570cc98f4e02a15655643","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:18" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:18" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:246104d51e71dd5077fdd05166c013d61520147b" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:6bd3351403de3b4f05662bf45ac1951425e73e69"
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
!~      revision                 = 18 -> (known after apply)
-       tags                     = {} -> null
#        (7 unchanged attributes hidden)
    }

  # aws_lb_listener.listerner will be updated in-place
!~  resource "aws_lb_listener" "listerner" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:listener/app/fastapi-lb-dev/78fa42d138c4f3f0/3cce75f109ad9d4c"
!~      ssl_policy        = "ELBSecurityPolicy-2016-08" -> "ELBSecurityPolicy-TLS13-1-2-2021-06"
        tags              = {}
#        (6 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #20](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7349118301)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>